{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "protein_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000], "dtype": "int32", "sparse": false, "name": "protein_input"}, "inbound_nodes": []}, {"name": "protein_embedding", "class_name": "Embedding", "config": {"name": "protein_embedding", "trainable": true, "batch_input_shape": [null, 1000], "dtype": "float32", "input_dim": 26, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1000}, "inbound_nodes": [[["protein_input", 0, 0, {}]]]}, {"name": "drug_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "int32", "sparse": false, "name": "drug_input"}, "inbound_nodes": []}, {"name": "conv1_prot", "class_name": "Conv1D", "config": {"name": "conv1_prot", "trainable": true, "filters": 1, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["protein_embedding", 0, 0, {}]]]}, {"name": "smiles_embedding", "class_name": "Embedding", "config": {"name": "smiles_embedding", "trainable": true, "batch_input_shape": [null, 100], "dtype": "float32", "input_dim": 65, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 100}, "inbound_nodes": [[["drug_input", 0, 0, {}]]]}, {"name": "conv2_prot", "class_name": "Conv1D", "config": {"name": "conv2_prot", "trainable": true, "filters": 2, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1_prot", 0, 0, {}]]]}, {"name": "conv1_smiles", "class_name": "Conv1D", "config": {"name": "conv1_smiles", "trainable": true, "filters": 1, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["smiles_embedding", 0, 0, {}]]]}, {"name": "conv3_prot", "class_name": "Conv1D", "config": {"name": "conv3_prot", "trainable": true, "filters": 3, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_prot", 0, 0, {}]]]}, {"name": "conv2_smiles", "class_name": "Conv1D", "config": {"name": "conv2_smiles", "trainable": true, "filters": 2, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1_smiles", 0, 0, {}]]]}, {"name": "conv3_smiles", "class_name": "Conv1D", "config": {"name": "conv3_smiles", "trainable": true, "filters": 3, "kernel_size": [2], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2_smiles", 0, 0, {}]]]}, {"name": "lstm_prot", "class_name": "LSTM", "config": {"name": "lstm_prot", "trainable": true, "return_sequences": "True", "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 3, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["conv3_prot", 0, 0, {}]]]}, {"name": "time_distributed_6", "class_name": "TimeDistributed", "config": {"name": "time_distributed_6", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "TD_conv", "trainable": true, "units": 3, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["conv3_prot", 0, 0, {}]]]}, {"name": "time_distributed_5", "class_name": "TimeDistributed", "config": {"name": "time_distributed_5", "trainable": true, "layer": {"class_name": "Dense", "config": {"name": "TD_lstm", "trainable": true, "units": 3, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["lstm_prot", 0, 0, {}]]]}, {"name": "lstm_smiles", "class_name": "LSTM", "config": {"name": "lstm_smiles", "trainable": true, "return_sequences": "True", "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 3, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["conv3_smiles", 0, 0, {}]]]}, {"name": "lambda_16", "class_name": "Lambda", "config": {"name": "lambda_16", "trainable": true, "function": ["4wEAAAAAAAAABgAAAAoAAABDAAAAc4gAAABkAWQAbAB9AWQBZABsAX0CfAFqAWoCoAN8AGQCGQBk\nA6ECfQN8AWoBagKgBHwBagFqAqAFfAFqAWoCagZ8AGQBGQBkAmQEZAWNA3wBagFqAmoGfANkBmQE\nZAWNA6ECoQF9BHwBagFqAqAEfAFqAWoCoAV8AGQBGQB8A6ECoQF8BBQAfQV8BVMAKQdO6QAAAADp\nAQAAAKkDcgEAAADpAgAAAHICAAAAVCkC2gRheGlz2ghrZWVwZGltc+n/////KQfaCnRlbnNvcmZs\nb3faBWtlcmFz2gdiYWNrZW5k2hJwZXJtdXRlX2RpbWVuc2lvbnPaB3NpZ21vaWTaCWJhdGNoX2Rv\ndNoEbWVhbikG2gF42gJ0ZnIJAAAA2gd0bXBfYV8y2ghtZWFuX2FsbNoFdG1wX2GpAHIUAAAA+hJG\nZWF0dXJlX0VuY29kZXIucHnaCGF0dF9mdW5jjgAAAHMMAAAAAAEIAQgCFAE+ASIC\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["time_distributed_6", 0, 0, {}], ["conv3_smiles", 0, 0, {}]]]}, {"name": "lambda_13", "class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "function": ["4wEAAAAAAAAABgAAAAoAAABDAAAAc4gAAABkAWQAbAB9AWQBZABsAX0CfAFqAWoCoAN8AGQCGQBk\nA6ECfQN8AWoBagKgBHwBagFqAqAFfAFqAWoCagZ8AGQBGQBkAmQEZAWNA3wBagFqAmoGfANkBmQE\nZAWNA6ECoQF9BHwBagFqAqAEfAFqAWoCoAV8AGQBGQB8A6ECoQF8BBQAfQV8BVMAKQdO6QAAAADp\nAQAAAKkDcgEAAADpAgAAAHICAAAAVCkC2gRheGlz2ghrZWVwZGltc+n/////KQfaCnRlbnNvcmZs\nb3faBWtlcmFz2gdiYWNrZW5k2hJwZXJtdXRlX2RpbWVuc2lvbnPaB3NpZ21vaWTaCWJhdGNoX2Rv\ndNoEbWVhbikG2gF42gJ0ZnIJAAAA2gd0bXBfYV8y2ghtZWFuX2FsbNoFdG1wX2GpAHIUAAAA+hJG\nZWF0dXJlX0VuY29kZXIucHnaCGF0dF9mdW5jjgAAAHMMAAAAAAEIAQgCFAE+ASIC\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["time_distributed_5", 0, 0, {}], ["lstm_smiles", 0, 0, {}]]]}, {"name": "lambda_18", "class_name": "Lambda", "config": {"name": "lambda_18", "trainable": true, "function": ["4wEAAAAAAAAABgAAAAkAAABDAAAAc3YAAABkAWQAbAB9AWQBZABsAX0CfAFqAWoCoAN8AGQBGQBk\nAqECfQN8AWoBagJqBHwDZANkBGQFjQN9BHwBagWgBnwEoQF9BHwBoAd8BGQGZAZ8AmoCoAh8AGQG\nGQChAWQHGQBmA6ECfQV8AaAJfABkBhkAfAWhAlMAKQhO6QAAAACpA3IBAAAA6QIAAADpAQAAAOn/\n////VCkC2gRheGlz2ghrZWVwZGltc3IEAAAAcgMAAAApCtoKdGVuc29yZmxvd9oFa2VyYXPaB2Jh\nY2tlbmTaEnBlcm11dGVfZGltZW5zaW9uc9oEbWVhbtoCbm7aB3NvZnRtYXjaBHRpbGXaCWludF9z\naGFwZdoIbXVsdGlwbHkpBtoBeNoCdGZyCQAAANoEdG1wMdoHdG1wX2FfMdoDdG1wqQByFwAAAPoS\nRmVhdHVyZV9FbmNvZGVyLnB52g1jb2VmZl9mdW5fbGlnlwAAAHMOAAAAAAEIAQgBFAEUAQwBIgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_16", 0, 0, {}], ["conv3_smiles", 0, 0, {}]]]}, {"name": "lambda_17", "class_name": "Lambda", "config": {"name": "lambda_17", "trainable": true, "function": ["4wEAAAAAAAAABQAAAAkAAABDAAAAc2YAAABkAWQAbAB9AWQBZABsAX0CfAFqAWoCagN8AGQBGQBk\nAmQDZASNA30DfAFqBKAFfAOhAX0DfAGgBnwDZAVkBXwCagKgB3wAZAUZAKEBZAYZAGYDoQJ9BHwB\noAh8AGQFGQB8BKECUwApB07pAAAAAOn/////VCkC2gRheGlz2ghrZWVwZGltc+kBAAAA6QIAAAAp\nCdoKdGVuc29yZmxvd9oFa2VyYXPaB2JhY2tlbmTaBG1lYW7aAm5u2gdzb2Z0bWF42gR0aWxl2glp\nbnRfc2hhcGXaCG11bHRpcGx5KQXaAXjaAnRmcggAAADaB3RtcF9hXzHaA3RtcKkAchQAAAD6EkZl\nYXR1cmVfRW5jb2Rlci5wedoOY29lZmZfZnVuX3Byb3SFAAAAcwwAAAAAAQgBCAIYAQwBIgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_16", 0, 0, {}], ["conv3_prot", 0, 0, {}]]]}, {"name": "lambda_15", "class_name": "Lambda", "config": {"name": "lambda_15", "trainable": true, "function": ["4wEAAAAAAAAABgAAAAkAAABDAAAAc3YAAABkAWQAbAB9AWQBZABsAX0CfAFqAWoCoAN8AGQBGQBk\nAqECfQN8AWoBagJqBHwDZANkBGQFjQN9BHwBagWgBnwEoQF9BHwBoAd8BGQGZAZ8AmoCoAh8AGQG\nGQChAWQHGQBmA6ECfQV8AaAJfABkBhkAfAWhAlMAKQhO6QAAAACpA3IBAAAA6QIAAADpAQAAAOn/\n////VCkC2gRheGlz2ghrZWVwZGltc3IEAAAAcgMAAAApCtoKdGVuc29yZmxvd9oFa2VyYXPaB2Jh\nY2tlbmTaEnBlcm11dGVfZGltZW5zaW9uc9oEbWVhbtoCbm7aB3NvZnRtYXjaBHRpbGXaCWludF9z\naGFwZdoIbXVsdGlwbHkpBtoBeNoCdGZyCQAAANoEdG1wMdoHdG1wX2FfMdoDdG1wqQByFwAAAPoS\nRmVhdHVyZV9FbmNvZGVyLnB52g1jb2VmZl9mdW5fbGlnlwAAAHMOAAAAAAEIAQgBFAEUAQwBIgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_13", 0, 0, {}], ["lstm_smiles", 0, 0, {}]]]}, {"name": "lambda_14", "class_name": "Lambda", "config": {"name": "lambda_14", "trainable": true, "function": ["4wEAAAAAAAAABQAAAAkAAABDAAAAc2YAAABkAWQAbAB9AWQBZABsAX0CfAFqAWoCagN8AGQBGQBk\nAmQDZASNA30DfAFqBKAFfAOhAX0DfAGgBnwDZAVkBXwCagKgB3wAZAUZAKEBZAYZAGYDoQJ9BHwB\noAh8AGQFGQB8BKECUwApB07pAAAAAOn/////VCkC2gRheGlz2ghrZWVwZGltc+kBAAAA6QIAAAAp\nCdoKdGVuc29yZmxvd9oFa2VyYXPaB2JhY2tlbmTaBG1lYW7aAm5u2gdzb2Z0bWF42gR0aWxl2glp\nbnRfc2hhcGXaCG11bHRpcGx5KQXaAXjaAnRmcggAAADaB3RtcF9hXzHaA3RtcKkAchQAAAD6EkZl\nYXR1cmVfRW5jb2Rlci5wedoOY29lZmZfZnVuX3Byb3SFAAAAcwwAAAAAAQgBCAIYAQwBIgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_13", 0, 0, {}], ["lstm_prot", 0, 0, {}]]]}, {"name": "global_max_pooling1d_10", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_10", "trainable": true}, "inbound_nodes": [[["lambda_18", 0, 0, {}]]]}, {"name": "global_max_pooling1d_9", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_9", "trainable": true}, "inbound_nodes": [[["lambda_17", 0, 0, {}]]]}, {"name": "global_max_pooling1d_12", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_12", "trainable": true}, "inbound_nodes": [[["lambda_15", 0, 0, {}]]]}, {"name": "global_max_pooling1d_11", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_11", "trainable": true}, "inbound_nodes": [[["lambda_14", 0, 0, {}]]]}, {"name": "concatenate_5", "class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "axis": -1}, "inbound_nodes": [[["global_max_pooling1d_10", 0, 0, {}], ["global_max_pooling1d_9", 0, 0, {}]]]}, {"name": "concatenate_6", "class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "axis": -1}, "inbound_nodes": [[["global_max_pooling1d_12", 0, 0, {}], ["global_max_pooling1d_11", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["concatenate_5", 0, 0, {}], ["concatenate_6", 0, 0, {}]]]}, {"name": "dense1", "class_name": "Dense", "config": {"name": "dense1", "trainable": true, "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense1", 0, 0, {}]]]}, {"name": "dense2", "class_name": "Dense", "config": {"name": "dense2", "trainable": true, "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense2", 0, 0, {}]]]}, {"name": "dense3", "class_name": "Dense", "config": {"name": "dense3", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"name": "dense4", "class_name": "Dense", "config": {"name": "dense4", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense3", 0, 0, {}]]]}], "input_layers": [["drug_input", 0, 0], ["protein_input", 0, 0]], "output_layers": [["dense4", 0, 0]]}, "keras_version": "2.2.0", "backend": "tensorflow"}